---
kind: type
id: T:Autodesk.Revit.DB.ViewNode
source: html/7cadfd9b-70df-5235-038f-a0535eee6f28.htm
---
# Autodesk.Revit.DB.ViewNode

A render node that represents a view.

## Syntax (C#)
```csharp
public class ViewNode : RenderNode
```

## Remarks
See also: OnViewBegin(ViewNode) .